MTO/3Dheatsink/app/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    "(p|pa|pb|pc)"
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.01;
        smoother        GaussSeidel;
    }

    "(U|Ua|Ub|Uc|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-6;
        relTol          0.1;
    }

     "(T|Ta|Tb)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;

}

relaxationFactors
{
    fields
    {
        "(p|pa|pb|pc)"     0.3;
         alpha             0.1;
    }
    equations
    {
        "(U|Ua|Ub|Uc)"     0.7;
        "(k|epsilon)"      0.7;
    }
}
power_dissipation
{
    numberConstraintPatches      2;
    constraintPatchesNames       (inlet outlet);
}
// ************************************************************************* //
